package errorMessage

import (
	"api/services/util/log"
	"fmt"
	"strconv"
	"strings"
)

var ErrorMessage = map[int64]string{
	1001000: "尚未登入",
	1001001: "系統不明錯誤",
	1001002: "欄位未填寫完整",
	1001003: "%v",
	1001004: "無此會員",
	1001005: "非主帳號無法使用",
	1001006: "目前無法管理此收銀機",
	1001007: "無訂單資料",
	1001008: "資料有誤",
	1001009: "檔案上傳失敗",
	1001010: "無此資料",

	1002001: "尚未是會員",
	1002002: "手機號碼格式錯誤",
	1002003: "輸入有誤，請重新輸入。",
	1002004: "此收銀機不存在",
	1002005: "你尚未完成管理員的電子郵件驗證，\n請先至電子郵件信箱收信並完成驗證後，再登入此收銀機。",
	1002006: "您登入錯誤已達3次",
	1002007: "OTP不正確",
	1002008: "請發送驗證碼並輸入驗證碼",
	1002009: "請輸入手機號碼",
	1002010: "系統維護中，目前無法接受新會員註冊。",

	1002101: "地址新增失敗",
	1002102: "地址刪除失敗",
	1002103: "地址查詢失敗",
	1002104: "地址欄位未填寫完整",
	1002105: "配送地址未填寫",
	1002106: "查無寄件地址",

	//Verify
	1003001: "認證失敗:",
	1003002: "已驗證完成",
	1003003: "已驗證過期",
	1003004: "驗證失敗",
	1003005: "無法完成身份認證，請確認您所輸入的資訊是否正確。",
	1003006: "驗證資料錯誤次數已達 3 次，今日無法再查詢，請於明日再查。",
	1003007: "警示異常的身份證",
	1003008: "尚未完成驗證",
	1003009: "行業別錯誤",
	1003010: "地址格式錯誤",
	1003011: "尚未完成EMAIL驗證",
	1003012: "尚未完成身份認證驗證",
	1003013: "尚未完成行業別設定",
	//商品
	1004001: "無商品資料",
	//結帳錯誤
	1005001: "你無法購買自己收銀機中的商品。",
	1005002: "付款失敗。",
	1005003: "地址格式錯誤",
	1005004: "ATM付款失敗",
	1005005: "餘額付款失敗",
	1005006: "信用卡付款失敗",
	1005007: "超商取貨付款失敗",
	1005008: "餘額不足",
	1005009: "商品庫存不足",
	1005010: "無帳單資訊",
	1005011: "未選擇運送方式",
	1005012: "未選擇付款方式",
	1005013: "選擇的商品沒有購買數量",
	1005014: "購物車無商品",
	1005015: "信用卡卡號錯誤",
	1005016: "餘額付款失敗",

	//帳單錯誤
	1006001: "已結帳",
	1006002: "帳單已取消",
	1006003: "商品已下架",
	1006004: "帳單已逾期",
	1006005: "無此商品",
	//商品上架
	1007001: "商品圖上傳失敗",
	1007002: "帳單已過期",
	1007003: "帳單已結帳",
	1007004: "無此帳單",
	1007005: "此帳單無法延期",
	1007006: "你無法接受自己的訂購單。",
	1007007: "商品數量不能為0",
	1007008: "商品金額不能為0",
	1007009: "內容長度過長",
	1007010: "此商品無法編輯",
	1007011: "免運數量或金額不能為0",
	//訂單取消
	1008001: "此訂單無法取消",
	1008002: "ATM轉帳期限尚未到期無法取消訂單，如交易無法完成請通知買家不要轉帳。",
	1008003: "退款失敗!",

	//購物車
	1009001: "購買商品少於限制",
	1009002: "購買商品大於限制",
	1009003: "商品庫存不足",
	1009004: "更新結帳清單失敗",
	1009005: "結帳清單內沒有商品",
	1009006: "結帳清單無法更改運送方式",
	1009007: "優惠代碼錯誤",
	1009008: "優惠金額不得小於等於結帳金額",
	1009009: "該折扣碼已失效",

	//外送
	1010001: "啟用外送服務需至少設定一個縣市區域",
	1011002: "名稱不得超出 20 字",
	1011003: "優惠碼數量須介於1和1000之間",
	1011004: "活動結束時間不得超過六個月",
	1011005: "折扣總金額不得超出NT$100,000",
	1011006: "活動結束時間格式有誤",
	1011007: "活動操作權限不足",
	1011008: "此活動優惠碼可取得組數不足",
	1011009: "優惠碼取號數量須介於1和1000之間",
	1011010: "優惠活動啟用進行僅提供5組",
	1011011: "優惠活動結束日期不可小於當下日期時間",

	//提領
	1012001: "餘額不足",
	1012002: "請輸入排除的賣家",
	1012003: "請輸入簡訊內容",
	1012004: "請輸入轉址",
	
}

func GetMessageByCode(code int64) (int64, string) {
	return code, ErrorMessage[code]
}

func GetMessageByCodeString(c string) (int64, string) {
	code, err := strconv.Atoi(c)
	if err != nil {
		log.Error("Error")
	}
	return int64(code), ErrorMessage[int64(code)]
}

func GetMessageFormatCode(code int64, err ...interface{}) (int64, string) {
	msg := ErrorMessage[code]
	if len(err) == 0 {
		return code, fmt.Sprintf(msg, err...)
	}
	if strings.Contains(msg, "%") && !strings.Contains(msg, "%%") {
		//format string
	} else {
		//do not contain format char
		msg += strings.Repeat(" %v", len(err))
	}
	return code, fmt.Sprintf(msg, err...)
}

func GetErrMessageByErrorCode(code int64, err error) (int64, string, error) {
	return code, ErrorMessage[code], err
}
